app/Observers/ReplyObserver.php

    public function creating(Reply $reply)
    {
        $topic = $reply->topic;
        //帖子回复数 + 1
        $topic->increment('reply_count',1);
---
update `topics` set `reply_count` = `reply_count` + 1, `updated_at` = '2018-05-08 00:58:15' where `id` = '28'