app/Observers/TopicObserver.php

    public function deleted(Topic $topic)
    {
        \DB::table('replies')->where('topic_id',$topic->id)->delete();
---
delete from `replies` where `topic_id` = '69'