app/Http/Controllers/CategoriesController.php

select * from `categories` where `categories`.`id` in ('1')
select * from `topics` where `category_id` = '1' order by `updated_at` desc limit 20 offset 0
select * from `users` where `users`.`id` in ('1', '2', '3', '5', '7', '8', '9', '10')
select count(*) as aggregate from `topics` where `category_id` = '1'
---
    public function show(Category $category)
    {
        // 读取分类 ID 关联的话题，并按每 20 条分页
        $topics = Topic::with('user','category')->where('category_id',$category->id)->paginate(20);