app/Http/Controllers/RepliesController.php

insert into `replies` (`content`, `user_id`, `topic_id`, `updated_at`, `created_at`) values ('<p>回复消息通知测试</p>', '8', '28', '2018-05-08 00:58:15', '2018-05-08 00:58:15')
select * from `topics` where `topics`.`id` = '4' limit 1
---
	public function store(ReplyRequest $request, Reply $reply)
	{
		$reply->content = $request->input('content','');
		$reply->user_id = Auth::id();
		$reply->topic_id= $request->topic_id;
		$reply->save();
		return redirect()->to($reply->topic->link())->with('success','成功回复！');

delete from `replies` where `id` = '1004'
---
	public function destroy(Reply $reply)
	{
		$this->authorize('destroy', $reply);
		$reply->delete();