app/Http/Controllers/TopicsController.php

	public function create(Topic $topic)
	{
	    $categories = Category::all();
---
select * from `categories`

	public function store(TopicRequest $request,Topic $topic)
	{
        $topic->fill($request->all());
        $topic->user_id = Auth::id();
        $topic->save();
---
insert into `topics` (`title`, `category_id`, `body`, `user_id`, `excerpt`, `updated_at`, `created_at`) values ('样式测试', '3', '<pre><code class=\"lang-php\">&lt;?php\r\n echo \"样式测试\";\r\n?&gt;</code></pre><blockquote><p>样式测试,<span style=\"color: rgb(51, 51, 51); font-size: 17.5px;\">样式测试,<span style=\"color: rgb(51, 51, 51); font-size: 17.5px;\">样式测试</span></span><br></p></blockquote><ul><li>023</li><li>021</li><li>022</li></ul><p><code>public function list&nbsp;</code></p>', '11', '&lt;?php  echo \"样式测试\"; ?&gt;样式测试,样式测试,样式测试023021022public function list&nbsp;', '2018-04-22 01:57:27', '2018-04-22 01:57:27')

	public function destroy(Topic $topic)
	{
		$this->authorize('destroy', $topic);
		$topic->delete();
---
delete from `topics` where `id` = '69'