app/Http/Controllers/UserController.php

    public function update(UserRequest $request,ImageUpload $upload, User $user)
    {
        // authorize 方法来检验用户是否授权
      //  $this -> authorize('update',$user);
        $data = $request -> all();
        // 处理上传图片保存并返回路径
        if($request -> avatar){
            $result = $upload ->save($request -> avatar,'avatar',$user ->id,362);
---
update `users` set `updated_at` = '2018-04-21 23:13:18', `avatar` = '/uploads/images/avatar/201804/21/11_1524370397_1ocoWIpYP1.jpg' where `id` = '11'