app/Models/User.php

update `users` set `updated_at` = '2018-05-08 02:42:37', `notification_count` = '0' where `id` = '1'
---
    public function notify($instance)
    {
      // 如果要通知的人是当前用户，就不必通知了
        if($this ->id == Auth::id())
        {
            return false;
        }
        $this->increment('notification_count');